{
  "education": [
    {
      "awards_achievements": [
        "Honours in Computer Science",
        "Dean's List 2021"
      ],
      "degree": "Bachelor of Computer Sciences",
      "department": "Computer Science Department",
      "duration": "2016-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AdrianZaia",
  "highlighted_projects": [
    {
      "description": "Developed an application that learns to play a racing simulator. Through a use of a reinforcement algorithim implemented from a Javascript library, the program woul repeatedly run the track of a race until it eventually found the proper way to do the course in the fastest time.",
      "name": "Video Game AI"
    },
    {
      "description": "Developed a bot that can fetch data from servers and if a specific part of the data changes, it will alert everyone in a group that bot is connected to of the changes that have occurred. In this regard, the bot tells everyone that a specific person has begun a livestream on a website.",
      "name": "DiscordBot"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed an MVP (Minimum Viable Product) that allows users to monitor a Linux Cluster that tracks each specific nodes hardware and resource usage in real time and submitting them to a database automatically. Developed through the use of: Linux CentOS 7, VNC, Git, Bash, Crontab, Docker, Github",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In-Progress",
        "JDBC App: In-Progress",
        "Grep App: Recreated the Linux Grep Tool, which is used to find specific phrases and words in a given file, through the use of Java Libraries and Maven on Visual Studio Code"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Adrian Zaia",
  "others": [
    {
      "bullets": [
        "Participated as a team of two in a robotics competition in highschool, me working as the robot builder and the my partner as the programmer for what the robot does. Placed 2nd place across the all the participating schools"
      ],
      "title": "Highschool Robotics Competition"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implementing projects to gain a deep understanding of new technology and software, while also working in an Agile \u0026 Scrum enviornment with my team members.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "RBC Royal Bank",
      "description": "Handled and Reported monthly collected IFRS9 Data to my Manager. Created presentations on collected IFRS9 Data for my manager and superiors. Resolved various database issues by assisting various team members. Communicated with clients to resolve any unforseen problems within the company",
      "duration": "May 2018 - August 2018",
      "title": "Operational Risk Analyst"
    }
  ],
  "skills": {
    "competent": [
      "C/C++",
      "Python",
      "C#",
      "Javascript",
      "Adobe Suite"
    ],
    "familiar": [
      "Unity Game Engine",
      "Unreal Game Engine",
      "GitHub",
      "Docker",
      "Node.JS"
    ],
    "proficient": [
      "Microsoft Suite",
      "Java",
      "HTML",
      "SQL",
      "CSS"
    ]
  },
  "summary": "my name is Adrian Zaia and I graduated with Honours in Computer Science at Ryerson University. I first started learning programming in High School with Java and HTML, I gained an interest in seeing these programs come to life through my own thinking and implementation, it felt like learning a new language to speak. I attended Ryerson University for my degree and was able to land a co-op job in the summer with RBC as an Operational Risk Analyst."
}
