{
  "education": [
    {
      "awards_achievements": [
        "Honours in Computer Science",
        "Dean's List 2021"
      ],
      "degree": "Bachelor of Computer Sciences",
      "department": "Computer Science Department",
      "duration": "2016-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AdrianZaia",
  "highlighted_projects": [
    {
      "description": "Developed an AI agent, through the use of OpenAI's Universe Software and Python, to play a browser racing game. The Universe software was implemented specifically for its ability to use a computer like a human and operate the game with a virtual mouse and keyboard. The AI agent was capable of looking at the pixels on a screen and gaining an understanding of the environment and would recursively learn its surroundings to know the safe location. Through the use of a reward system, the agent learned what was the right and wrong maneuver to complete a race track.",
      "name": "Video Game AI"
    },
    {
      "description": "Developed a bot for Discord through the use of Node.js and Javascript as a means to accomplish certain tasks. One of the commands would command the bot to show an image. The command used was \"!meme\" and this triggered the bot to go through the array of given websites and then, through the use of a random integer generator function, would pick out an image at random to display for everyone in that particular group chat. Another task the bot was responsible for, was to monitor a specific Livestream and to alert everyone in a server of any changes. This was accomplished by using IFTTT (If This Then That) website and integrating Webhooks into the bot and once a person has begun streaming for the specified channel, the bot would send an alert of the Livestream.",
      "name": "Discord Bot"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed an MVP (Minimum Viable Product) that allows the Jarvis Linux Cluster Administration team to monitor a Linux Cluster that tracks each specific nodes hardware and resource usage in real time and submits them to a database automatically. This was accomplished through the use of Bash Scripts on a Linux CentOS 7 virtual machine, and the data collected is stored on a PostgreSQL database, maintained by Docker, every minute through Crontab.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Grep App: Developed a Java application that functions similarly to the grep command in Linux. This application takes in a user inputted regex and searches for that same regex pattern in a given directory and then outputs the lines, matching the input, to an output file. The app itself was written on Java 8 and made on Visual Studio Code.",
        "JDBC: In-Progress"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Adrian Zaia",
  "others": [
    {
      "bullets": [
        "Participated as a team of two in a robotics competition, I was working as the robot builder that would accomplish a specific task, such as an elevator. While  my partner as the programmer for what the robot does through the use of C++. We placed in 2nd place across all participants."
      ],
      "title": "Highschool Robotics Competition"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developing, and implementing, programs and functions through the use of software and programming languages that are the standard for today's workplace. Also worked in an Agile \u0026 Scrum environment with my assigned team members. I am tasked to conduct daily Scrum meetings with my team and write down notes on any new developments with me and my team's projects. We conduct Sprint meetings every two weeks to discuss what went right during the Sprint and look to what we are going to work on and how to work on it more efficiently than the previous project.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "RBC Royal Bank",
      "description": "Handled and maintained IFRS9 data that was automatically recorded into multiple JDBC databases. I was able to access, and edit these databases through the use of the Squirrel SQL tool and write down any errors I encountered. Based on the errors I encountered, I would create presentations on Microsoft Powerpoint about the errors and present them to my team for review. I was also tasked with constantly checking a work email that employees of RBC would write to if they encountered an issue and I would assist them through their problems.",
      "duration": "May 2018 - August 2018",
      "title": "Operational Risk Analyst"
    }
  ],
  "skills": {
    "competent": [
      "C/C++",
      "Python",
      "C#",
      "Javascript",
      "Adobe Suite",
      "IntelliJ",
      "Linux/Bash"
    ],
    "familiar": [
      "Unity Game Engine",
      "Unreal Game Engine",
      "Git",
      "Docker",
      "Node.JS",
      "React",
      "OpenAI Universe"
    ],
    "proficient": [
      "Java",
      "HTML",
      "SQL",
      "CSS",
      "Agile/Scrum",
      "Github",
      "Visual Studio Code"
    ]
  },
  "summary": "I graduated with Honours in Computer Science at Ryerson University in 2021. Throughout my time as an undergraduate, I was able to expand my knowledge in object-oriented programming languages through the courses offered by my university's curriculum and through extracurricular clubs that were focused on specific programming languages, or software, geared towards my interests. I was able to land a co-op job at RBC as an Operational Risk Analyst for the summer of 2018 which helped me gain a deeper insight into the inner workings of big companies and how the Agile Framework functions in a real-world setting. I have joined Jarvis recently as a consultant to hone my skills in different programming fields outside of object-oriented programming and hope to show what I can do with my ideas and knowledge."
}
